Revit 2027 API
Frame Constructor
Overload List
Name | Description
Frame() |  Default constructor. Uses global origin and standard basis vectors.
Frame(XYZ, XYZ, XYZ, XYZ) |  Constructor that takes the frame's base point and three basis vectors.
Top
See Also
Reference
Frame Class
Autodesk.Revit.DB Namespace